STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_progcsrskiptrain.c
/**
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include <stdlib.h>

#include "stm32mp2xx_hal_ddr_ddrphy_phyinit.h"
#include "stm32mp2xx_hal_ddr_ddrphy_wrapper.h"

typedef struct
{
  int32_t tstaoff[NB_PS];
  int32_t tpdm[NB_PS];
  int32_t tcasl_add[NB_PS];
} phyinit_timings_t;

static phyinit_timings_t timings;

/*
 * set tstaoff, tpdm and tcasl_add
 */
static void set_timings(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    timings.tstaoff[pstate] = 0;
    timings.tpdm[pstate] = 0;

    timings.tcasl_add[pstate] = 0;
  }
}

/*
 * Program dfimrl per P-state according to this formula:
 *
 *         dfimrl = ceiling( (ARdPtrinitval*UI + phy_tx_insertion_dly +
 *                            phy_rx_insertion_dly + PHY_Rx_Fifo_dly + tDQSCK + tstaoff) /
 *                           dficlk_period)
 *
 * All terms in above equation specified in ps
 * tDQSCK - determine from memory model
 * tstaoff - determine from memory model
 * phy_tx_insertion_dly = 200ps
 * phy_rx_insertion_dly = 200ps
 * phy_rx_fifo_dly      = 200ps + 4UI
 */
static void dfimrl_program(void)
{
  int32_t pstate;

  /* ### Set dfimrl per p-state ### // */
  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    int32_t dfimrl_in_dficlk;
    uint32_t p_addr;
    int32_t phy_rx_fifo_dly;
    int32_t phy_rx_insertion_dly = 200;
    int32_t phy_tx_insertion_dly = 200;
    int64_t dficlk_period_x1000;
    int64_t dfimrl_in_fs;
    int64_t uifs;
    uint16_t dfimrl;

    p_addr = (uint32_t)pstate << 20;

    uifs = (1000 * 1000000 * 1) / (userinputbasic.frequency[pstate] * 2);
    dficlk_period_x1000 = 4 * uifs;

    phy_rx_fifo_dly = (int32_t)(((200 * 1000) + 4 * uifs) / 1000);

    dfimrl_in_fs = (ardptrinitval[pstate] * uifs) +
                   ((phy_tx_insertion_dly + phy_rx_insertion_dly + phy_rx_fifo_dly +
                    timings.tstaoff[pstate] + timings.tcasl_add[pstate] +
                    timings.tpdm[pstate]) * 1000);

    dfimrl_in_dficlk = (int32_t)dfimrl_in_fs / dficlk_period_x1000;
    if ((dfimrl_in_fs % dficlk_period_x1000) != 0)
    {
      dfimrl_in_dficlk++;
    }
    dfimrl = (uint16_t)dfimrl_in_dficlk + (uint16_t)mb_ddr_1d[pstate].dfimrlmargin;

    /*
     * mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | CBRD |
     *                                              CSR_DFIMRL_ADDR))),
     *               dfimrl);
     */
    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      uint32_t c_addr;

      c_addr = (uint32_t)byte << 12;
      mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | CSR_DFIMRL_ADDR))),
                    dfimrl);
    }

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TMASTER | CSR_HWTMRL_ADDR))),
                  dfimrl);
  }
}

/*
 * Program txdqsdlytg0/1[9:0] per P-State:
 *
 *         txdqsdlytg*[9:6] = floor( (4*UI + tstaoff) / UI)
 *         txdqsdlytg*[5:0] = ceiling( (tstaoff%UI / UI) * 32)
 *
 * tstaoff and UI expressed in ps
 *
 * For HMD and LPDDR4X and MEMCLK <= 533 mhz:
 *    txdqsdlytg*[9:6] = 0x5
 *
 * For other dimm types, leave TDqsDlyTg*[9:0] at default 0x100
 *
 * ppp_0001_cccc_uuuu_1101_0000
 *
 * if DDR3 or DDR4
 *      num_timingroup = numrank_dfi0;
 * else
 *      num_timingroup = numrank_dfi0 + numrank_dfi1 * dfi1exists;
 */
static void txdqsdlytg_program(uint16_t *txdqsdly)
{
  int32_t pstate;

  /* ### Set per p-state ### // */
  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    uint32_t p_addr;
    int32_t txdqsdlytg_5to0; /* Fine delay - 1/32UI per increment */
    int32_t txdqsdlytg_9to6; /* Coarse delay - 1UI per increment */
    int32_t txdqsdlytg_fine_default = 0;
    int32_t txdqsdlytg_coarse_default = 4;
    int64_t tmp_value;
    int64_t uifs;

    p_addr = (uint32_t)pstate << 20;

    uifs = (1000 * 1000000 * 1) / (userinputbasic.frequency[pstate] * 2);

    txdqsdlytg_9to6 = (int32_t)(((int32_t)((txdqsdlytg_coarse_default * uifs) / 1000) +
                                 timings.tstaoff[pstate] + timings.tcasl_add[pstate] -
                                 timings.tpdm[pstate]) / (int32_t)(uifs / 1000));

    tmp_value = fmodll((txdqsdlytg_fine_default * uifs / 32 +
                        ((timings.tstaoff[pstate] +  timings.tcasl_add[pstate]) * 1000) -
                        (timings.tpdm[pstate] * 1000)),
                       uifs);
    txdqsdlytg_5to0 = (int32_t)(tmp_value / uifs * 32);
    if ((tmp_value % uifs) != 0)
    {
      txdqsdlytg_5to0++;
    }

    /* Bit-5 of LCDL is no longer used, so bumping bit-5 of fine_dly up to coarse_dly */
    if (txdqsdlytg_5to0 >= 32)
    {
      txdqsdlytg_9to6 = txdqsdlytg_9to6 + 1;
      txdqsdlytg_5to0 = txdqsdlytg_5to0 - 32;
    }

    txdqsdly[pstate] = (uint16_t)((txdqsdlytg_9to6 << 6) | txdqsdlytg_5to0);

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      uint32_t c_addr;
      int32_t nibble;

      c_addr = (uint32_t)byte << 12;
      for (nibble = 0; nibble < 2; nibble++)
      {
        uint32_t u_addr;

        if (ddrphy_phyinit_isdbytedisabled(byte))
        {
          continue;
        }

        u_addr = (uint32_t)nibble << 8;

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
        if ((mb_ddr_1d[pstate].cspresent & 0x1) >> 0)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_TXDQSDLYTG0_ADDR))),
                        txdqsdly[pstate]);
        }
#elif STM32MP_LPDDR4_TYPE
        if ((((mb_ddr_1d[pstate].cspresentcha & 0x1U) >> 0) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x1U) >> 0)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_TXDQSDLYTG0_ADDR))),
                        txdqsdly[pstate]);
        }

