STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_progcsrskiptrain.c
        if ((((mb_ddr_1d[pstate].cspresentcha & 0x2U) >> 1) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x2U) >> 1)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_TXDQSDLYTG1_ADDR))),
                        txdqsdly[pstate]);
        }
#endif /* STM32MP_LPDDR4_TYPE */
      }
    }
  }
}

/*
 * ##############################################################
 *
 * Program txdqdlyTg0/1[8:0] per P-state:
 *
 *     txdqdlyTg*[8:6] = floor( (txdqsdlytg*[5:0]*UI/32 + tDQS2DQ + 0.5UI) / UI)
 *     txdqdlyTg*[5:0] = ceil( ((txdqsdlytg*[5:0]*UI/32 + tDQS2DQ + 0.5UI)%UI / UI) * 32)
 *
 * ##############################################################
 */
static void txdqdlytg_program(uint16_t *txdqsdly)
{
  int32_t pstate;

  /* ### Set per p-state ### // */
  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    uint32_t p_addr;
    int32_t txdqdly_5to0; /* Fine delay - 1/32UI per increment */
    int32_t txdqdly_8to6; /* Coarse delay - 1UI per increment */
    int32_t txdqsdlytg_5to0; /* Fine delay - 1/32UI per increment */
    int64_t tmp_value;
    int64_t uifs;
    uint16_t txdqdly;

    p_addr = (uint32_t)pstate << 20;

    uifs = (1000 * 1000000 * 1) / (userinputbasic.frequency[pstate] * 2);

    txdqsdlytg_5to0 = (int32_t)txdqsdly[pstate] & 0x3f;

    txdqdly_8to6 = (int32_t)(((txdqsdlytg_5to0 * uifs / 32) + (uifs / 2)) / uifs);
    tmp_value = fmodll(((txdqsdlytg_5to0 * uifs / 32) + (uifs / 2)), uifs);
    txdqdly_5to0 = (int32_t)(((tmp_value * 32) / uifs));
    if ((tmp_value % uifs) != 0)
    {
      txdqdly_5to0++;
    }

    /* Bit-5 of LCDL is no longer used, so bumping bit-5 of fine_dly up to coarse_dly */
    if (txdqdly_5to0 >= 32)
    {
      txdqdly_8to6 = txdqdly_8to6 + 1;
      txdqdly_5to0 = txdqdly_5to0 - 32;
    }

    txdqdly = (uint16_t)((txdqdly_8to6 << 6) | txdqdly_5to0);

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      uint32_t c_addr;
      int32_t lane;

      c_addr = (uint32_t)byte << 12;
      for (lane = 0; lane < 9; lane++)
      {
        uint32_t r_addr;

        if (ddrphy_phyinit_isdbytedisabled(byte))
        {
          continue;
        }

        r_addr = (uint32_t)lane << 8;

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
        if (((mb_ddr_1d[pstate].cspresent & 0x1) >> 0) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | r_addr |
                                                        CSR_TXDQDLYTG0_ADDR))),
                        txdqdly);
        }
#elif STM32MP_LPDDR4_TYPE
        if ((((mb_ddr_1d[pstate].cspresentcha & 0x1U) >> 0) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x1U) >> 0)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | r_addr |
                                                        CSR_TXDQDLYTG0_ADDR))),
                        txdqdly);
        }

        if ((((mb_ddr_1d[pstate].cspresentcha & 0x2U) >> 1) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x2U) >> 1)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | r_addr |
                                                        CSR_TXDQDLYTG1_ADDR))),
                        txdqdly);
        }
#endif /* STM32MP_LPDDR4_TYPE */
      }
    }
  }
}

/*
 * Program rxendly0/1[10:0] per P-State:
 *
 *         rxendly[10:6] = floor( (4*UI + tDQSCK + tstaoff) / UI)
 *         rxendly[5:0]  = ceil( ((tDQSCK + tstaoff) % UI) * 32)
 *
 * tDQSCK, tstaoff and UI expressed in ps
 */
static void rxendly_program(void)
{
  int32_t pstate;
  int32_t rxendly_coarse_default = 4;
  int32_t rxendly_fine_default = 0;

  /* ### Set per p-state ### // */
  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t __unused backoff_x1000;
    int32_t __unused zerobackoff_x1000;
    int32_t byte;
    uint32_t p_addr;
    int32_t rxendly_10to6; /* Coarse delay - 1UI per increment */
    int32_t rxendly_5to0; /* Fine delay - 1/32UI per increment */
    int32_t totfinestep;
    int64_t finestepfs; /* fine steps in fs */
    int64_t rxendly_offset_x1000000 = 0; /* 0 offset is 1UI before the first DQS. */
    int64_t totfs;
    int64_t uifs;
    uint16_t rxendly;

    p_addr = (uint32_t)pstate << 20;

    uifs = (1000 * 1000000 * 1) / (userinputbasic.frequency[pstate] * 2);

#if STM32MP_LPDDR4_TYPE
    /* Compensate for pptenrxenbackoff */
    zerobackoff_x1000 = (1000 * 24) / 32;
    if (userinputadvanced.lp4rxpreamblemode[pstate] == 1)
    {
      backoff_x1000 = (1000 * 1) - ((1000 * 2) / 32);
    }
    else
    {
      backoff_x1000 = (1000 * userinputadvanced.rxenbackoff) - ((1000 * 2) / 32);
    }

    if (!userinputadvanced.disableretraining)
    {
      rxendly_offset_x1000000 = userinputbasic.frequency[pstate] < 333 ?
                                backoff_x1000 * uifs : zerobackoff_x1000 * uifs;
    }
    else
    {
      rxendly_offset_x1000000 = zerobackoff_x1000 * uifs;
    }
#endif /* STM32MP_LPDDR4_TYPE */

    finestepfs = uifs / 32;
    totfs = ((32 * rxendly_coarse_default * finestepfs) +
             (rxendly_fine_default * finestepfs) +
             ((timings.tstaoff[pstate] + timings.tcasl_add[pstate] + timings.tpdm[pstate]) * 1000) +
             (rxendly_offset_x1000000 / 1000));
    totfinestep = totfs / finestepfs;

    rxendly_10to6 = totfinestep / 32;
    rxendly_5to0  = fmodi(totfinestep, 32);

    /* Bit-5 of LCDL is no longer used, so bumping bit-5 of fine_dly up to coarse_dly */
    if (rxendly_5to0 >= 32)
    {
      rxendly_10to6 = rxendly_10to6 + 1;
      rxendly_5to0 = rxendly_5to0 - 32;
    }

    rxendly = (uint16_t)((rxendly_10to6 << 6) | rxendly_5to0);

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      uint32_t c_addr;
      int32_t nibble;

      c_addr = (uint32_t)byte << 12;
      for (nibble = 0; nibble < 2; nibble++)
      {
        uint32_t u_addr;

        if (ddrphy_phyinit_isdbytedisabled(byte))
        {
          continue;
        }

        u_addr = (uint32_t)nibble << 8;

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
        if (((mb_ddr_1d[pstate].cspresent & 0x1U) >> 0) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_RXENDLYTG0_ADDR))),
                        rxendly);
        }
#elif STM32MP_LPDDR4_TYPE
        if ((((mb_ddr_1d[pstate].cspresentcha & 0x1U) >> 0) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x1U) >> 0)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_RXENDLYTG0_ADDR))),
                        rxendly);
        }

