STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_progcsrskiptrain.c
        if ((((mb_ddr_1d[pstate].cspresentcha & 0x2U) >> 1) |
             ((mb_ddr_1d[pstate].cspresentchb & 0x2U) >> 1)) != 0U)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr | u_addr |
                                                        CSR_RXENDLYTG1_ADDR))),
                        rxendly);
        }
#endif /* STM32MP_LPDDR4_TYPE */
      }
    }
  }
}

#if STM32MP_LPDDR4_TYPE
/*
 * Programming Seq0BGPR1/2/3 for LPDDR4
 */
static void seq0bgpr_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    /* for each p_addr */
    int32_t extradly;
    int32_t rl = 0; /* computed read latency */
    int32_t wl = 0; /* computed write latency */
    uint16_t mr_dbi_rd; /* extracted field from MR */
    uint16_t mr_rl;
    uint16_t mr_wl;
    uint16_t mr_wls;
    uint16_t regdata;
    uint32_t ps;

    extradly = 3; /* LPDDR4 */

    switch (pstate)
    {
      case 0:
        ps = P0;
        break;
      case 1:
        ps = P1;
        break;
      case 2:
        ps = P2;
        break;
      case 3:
        ps = P3;
        break;
      default:
        ps = P0;
        break;
    }

    mr_rl = (uint16_t)userinputadvanced.lp4rl[pstate];        /* RL[2:0] */
    mr_wl = (uint16_t)userinputadvanced.lp4wl[pstate];        /* WL[5:3] */
    mr_wls = (uint16_t)userinputadvanced.lp4wls[pstate];      /* WLS */
    mr_dbi_rd = (uint16_t)userinputadvanced.lp4dbird[pstate]; /* DBI-RD */

    switch (mr_dbi_rd << 3 | mr_rl)
    {
      /* DBI-RD Disabled */
      case 0U:
        rl = 6;
        break;
      case 1U:
        rl = 10;
        break;
      case 2U:
        rl = 14;
        break;
      case 3U:
        rl = 20;
        break;
      case 4U:
        rl = 24;
        break;
      case 5U:
        rl = 28;
        break;
      case 6U:
        rl = 32;
        break;
      case 7U:
        rl = 36;
        break;
      /* DBI-RD Enabled */
      case 8U:
        rl = 6;
        break;
      case 9U:
        rl = 12;
        break;
      case 10U:
        rl = 16;
        break;
      case 11U:
        rl = 22;
        break;
      case 12U:
        rl = 28;
        break;
      case 13U:
        rl = 32;
        break;
      case 14U:
        rl = 36;
        break;
      case 15U:
        rl = 40;
        break;
      default:
        rl = 6;
        break;
    }

    switch (mr_wls << 3 | mr_wl)
    {
      /* DBI-RD Disabled */
      case  0U:
        wl = 4;
        break;
      case  1U:
        wl = 6;
        break;
      case  2U:
        wl = 8;
        break;
      case  3U:
        wl = 10;
        break;
      case  4U:
        wl = 12;
        break;
      case  5U:
        wl = 14;
        break;
      case  6U:
        wl = 16;
        break;
      case  7U:
        wl = 18;
        break;
      /* DBI-RD Enabled */
      case  8U:
        wl = 4;
        break;
      case  9U:
        wl = 8;
        break;
      case 10U:
        wl = 12;
        break;
      case 11U:
        wl = 18;
        break;
      case 12U:
        wl = 22;
        break;
      case 13U:
        wl = 26;
        break;
      case 14U:
        wl = 30;
        break;
      case 15U:
        wl = 34;
        break;
      default:
        wl = 4;
        break;
    }

    /* Program Seq0b_GPRx */
    regdata = (uint16_t)((rl - 5 + extradly) << CSR_ACSMRCASLAT_LSB);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (ps | C0 | TINITENG | R2 | CSR_SEQ0BGPR1_ADDR))),
                  regdata);

    regdata = (uint16_t)((wl - 5 + extradly) << CSR_ACSMWCASLAT_LSB);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (ps | C0 | TINITENG | R2 | CSR_SEQ0BGPR2_ADDR))),
                  regdata);

    regdata = (uint16_t)((rl - 5 + extradly + 4 + 8) << CSR_ACSMRCASLAT_LSB);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (ps | C0 | TINITENG | R2 | CSR_SEQ0BGPR3_ADDR))),
                  regdata);
  } /* for each p_addr */
}

/*
 * Program hwtlpcsena and hwtlpcsenb based on number of ranks per channel
 * Applicable only for LPDDR4.  These CSRs have no effect
 * for DDR3/4
 *
 * CSRs to program:
 *      hwtlpcsena
 *      hwtlpcsenb
 *
 * User input dependencies:
 *      dramtype
 *      dfi1exists
 *      numrank_dfi0
 *      numrank_dfi1
 */
static void hwtlpcsen_program(void)
{
  uint16_t hwtlpcsena;
  uint16_t hwtlpcsenb;

  /* Channel A - 1'b01 if signal-rank, 2'b11 if dual-rank */
  hwtlpcsena = (uint16_t)userinputbasic.numrank_dfi0 | 0x1U;
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_HWTLPCSENA_ADDR))), hwtlpcsena);

  /*
   * Channel B - 1'b01 if signal-rank, 2'b11 if dual-rank
   * If DFI1 exists but disabled, numrank_dfi0 is used to program CsEnB
   */
  if (userinputbasic.dfi1exists == 1 && userinputbasic.numactivedbytedfi1 == 0)
  {
    hwtlpcsenb = (uint16_t)userinputbasic.numrank_dfi0 | 0x1U;
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_HWTLPCSENB_ADDR))),
                  hwtlpcsenb);
  }
  else if (userinputbasic.dfi1exists == 1 && userinputbasic.numactivedbytedfi1 > 0)
  {
    hwtlpcsenb = (uint16_t)userinputbasic.numrank_dfi1 | 0x1U;
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_HWTLPCSENB_ADDR))),
                  hwtlpcsenb);
  }
  else
  {
    /* Disable Channel B */
    hwtlpcsenb = 0x0U;
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_HWTLPCSENB_ADDR))),
                  hwtlpcsenb);
  }
}

/*
 * Program pptdqscntinvtrntg0 and pptdqscntinvtrntg1
 * Calculated based on tDQS2DQ and Frequencey
 * Applicable to LPDDR4 only
 *
 * 65536*(tdqs2dq_value_rank<rank>_chan<chan>*2)/(2*2048*UI(ps)_int)
 *
 * CSRs to program:
 *      pptdqscntinvtrntg0
 *      pptdqscntinvtrntg1
 *
 * User input dependencies:
 *      tDQS2DQ
 *      frequency
 */
static void pptdqscntinvtrntg_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    uint32_t p_addr;
    int32_t numrank_total;
    int32_t rank;

    /* Calculate total number of timing groups (ranks) */
    numrank_total = userinputbasic.numrank_dfi0 +
                    userinputbasic.numrank_dfi1 * userinputbasic.dfi1exists;

