STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_progcsrskiptrain.c
    p_addr = (uint32_t)pstate << 20;

    /* ### Set per timing group ### // */
    for (rank = 0; rank < numrank_total; rank++)
    {
      int32_t byte;
      uint16_t pptdqscntinvtrntg0;
      uint16_t pptdqscntinvtrntg1;

      switch (rank)
      {
        case 0:
          pptdqscntinvtrntg0 = 0U;
          break;
        case 1:
          pptdqscntinvtrntg1 = 0U;
          break;
      }

      for (byte = 0; byte < userinputbasic.numdbyte; byte++)
      {
        uint32_t c_addr;

        c_addr = (uint32_t)byte << 12;
        if (rank == 0)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr |
                                                        CSR_PPTDQSCNTINVTRNTG0_ADDR))),
                        pptdqscntinvtrntg0);
        }
        else if (rank == 1)
        {
          mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TDBYTE | c_addr |
                                                        CSR_PPTDQSCNTINVTRNTG1_ADDR))),
                        pptdqscntinvtrntg1);
        }
      }
    }
  }
}

/*
 * CSRs to program:
 *      PptCtlStatic:: DOCByteSelTg0/1
 *                   :: pptenrxenbackoff
 *
 * User input dependencies::
 *      dramtype
 *      dramdatawidth
 * Sim dependencies::
 *      DramByteSwap
 */
static void pptctlstatic_program(void)
{
  int32_t byte;
  int32_t pptenrxenbackoff;

  /*
   * The customer will setup some fields in this csr so the fw needs to do a
   * read-modify-write here.
   */

  if (userinputadvanced.lp4rxpreamblemode[0] == 1)
  {
    /* Rx-preamble mode for PS0 */
    /* Programming PptCtlStatic detected toggling preamble */
    pptenrxenbackoff = 0x1; /* toggling RD_PRE */
  }
  else
  {
    pptenrxenbackoff = userinputadvanced.rxenbackoff; /* static RD_PRE */
  }

  for (byte = 0; byte < userinputbasic.numdbyte; byte++)
  {
    uint32_t c_addr;
    uint16_t regdata;
    uint8_t pptentg1;
    uint32_t docbytetg0;
    uint32_t docbytetg1;

    /* Each Dbyte could have a different configuration. */
    c_addr = (uint32_t)byte * C1;
    if (byte % 2 == 0)
    {
      docbytetg0 = 0x1U & (uint32_t)(userinputadvanced.drambyteswap >> byte);
      docbytetg1 = 0x1U & (uint32_t)(userinputadvanced.drambyteswap >> byte);
    }
    else
    {
      docbytetg0 = 0x1U & (uint32_t)(~(userinputadvanced.drambyteswap >> byte));
      docbytetg1 = 0x1U & (uint32_t)(~(userinputadvanced.drambyteswap >> byte));
    }

    pptentg1 = ((userinputbasic.numrank_dfi0 == 2) || (userinputbasic.numrank_dfi1 == 2)) ?
               0x1U : 0x0U;
    regdata = (uint16_t)(0x1U << CSR_PPTENDQS2DQTG0_LSB | pptentg1 << CSR_PPTENDQS2DQTG1_LSB |
                         0x1U << CSR_PPTENRXENDLYTG0_LSB | pptentg1 << CSR_PPTENRXENDLYTG1_LSB |
                         pptenrxenbackoff << CSR_PPTENRXENBACKOFF_LSB |
                         docbytetg0 << CSR_DOCBYTESELTG0_LSB | docbytetg1 << CSR_DOCBYTESELTG1_LSB);

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (c_addr | TDBYTE | CSR_PPTCTLSTATIC_ADDR))),
                  regdata);
  }
}
#endif /* STM32MP_LPDDR4_TYPE */

/*
 * Program hwtcamode based on dram type
 *
 * CSRs to program:
 *      hwtcamode::hwtlp3camode
 *               ::hwtd4camode
 *               ::hwtlp4camode
 *               ::hwtd4altcamode
 *               ::hwtcsinvert
 *               ::hwtdbiinvert
 *
 * User input dependencies::
 *      dramtype
 */
static void hwtcamode_program(void)
{
  int32_t hwtlp3camode = 0;
  int32_t hwtd4camode = 0;
  int32_t hwtlp4camode = 0;
  int32_t hwtd4altcamode = 0;
  int32_t hwtcsinvert = 0;
  int32_t hwtdbiinvert = 0;
  uint16_t hwtcamode;

#if STM32MP_DDR4_TYPE
  hwtd4camode = 1;
#elif STM32MP_LPDDR4_TYPE
  hwtlp4camode = 1;
  hwtcsinvert = 1;
  hwtdbiinvert = 1;
#endif /* STM32MP_LPDDR4_TYPE */

  hwtcamode = (uint16_t)((hwtdbiinvert << CSR_HWTDBIINVERT_LSB) |
                         (hwtcsinvert << CSR_HWTCSINVERT_LSB) |
                         (hwtd4altcamode << CSR_HWTD4ALTCAMODE_LSB) |
                         (hwtlp4camode << CSR_HWTLP4CAMODE_LSB) |
                         (hwtd4camode << CSR_HWTD4CAMODE_LSB) |
                         (hwtlp3camode << CSR_HWTLP3CAMODE_LSB));

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_HWTCAMODE_ADDR))), hwtcamode);
}

/*
 * Program DllGainCtl and DllLockParam based on frequency
 */
static void dllgainctl_dlllockparam_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    uint16_t dllgainiv;
    uint16_t dllgaintv;
    int32_t lcdlseed;
    int32_t memck_freq;
    uint32_t p_addr;
    int32_t stepsize_x10 = 47;  /*
                                 * Nominal stepsize, in units of tenths of a ps,
                                 * if nominal=4.7ps use 47
                                 */
    uint16_t wddllgainctl;
    uint16_t wddlllockparam;

    memck_freq = userinputbasic.frequency[pstate];
    /*
     * lcdlseed = ((1000000/memck_freq)/2)/lcdl_stepsize  ...
     * where default lcdl_stepsize=4.7  in simulation
     */
    p_addr = (uint32_t)pstate << 20;

    dllgainiv = 0x00U;
    dllgaintv = 0x02U;

    if (memck_freq >= 332)
    {
      dllgainiv = 0x01U;
      dllgaintv = 0x03U;
    }
    if (memck_freq >= 532)
    {
      dllgainiv = 0x02U;
      dllgaintv = 0x04U;
    }
    if (memck_freq >= 800)
    {
      dllgainiv = 0x03U;
      dllgaintv = 0x05U;
    }
    if (memck_freq >= 1200)
    {
      dllgainiv = 0x04U;
      dllgaintv = 0x05U;
    }

    /*
     * lcdlseed= (1000000/(2*memck_freq)) * (100/(120*(stepsize_nominal)));
     * *100/105 is to bias the seed low
     */
    lcdlseed = (1000000 * 10 * 100) / (2 * memck_freq * stepsize_x10 * 105);

    if (lcdlseed > 511 - 32)
    {
      lcdlseed = 511 - 32;
    }

    if (lcdlseed < 32)
    {
      lcdlseed = 32;
    }

    wddllgainctl = (uint16_t)((CSR_DLLSEEDSEL_MASK & 0x0000U) |
                              (CSR_DLLGAINTV_MASK & (dllgaintv << CSR_DLLGAINTV_LSB)) |
                              (CSR_DLLGAINIV_MASK & (dllgainiv << CSR_DLLGAINIV_LSB)));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TMASTER | CSR_DLLGAINCTL_ADDR))),
                  wddllgainctl);


    wddlllockparam = (uint16_t)((CSR_LCDLSEED0_MASK & ((uint16_t)lcdlseed << CSR_LCDLSEED0_LSB)) |
                                (CSR_DISDLLGAINIVSEED_MASK & 0xFFFFU) |
                                (CSR_DISDLLSEEDSEL_MASK & 0x0000U));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TMASTER | CSR_DLLLOCKPARAM_ADDR))),
                  wddlllockparam);
  }
}

