STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_progcsrskiptrain.c
/*
 * Program AcsmCtrl23 for Fw and Ppt.
 *
 * CSRs to program:
 *   AcsmCtrl23::AcsmCsMask
 *               AcsmCsMode
 */
static void acsmctrl23_program(void)
{
  uint16_t regdata;

  regdata = (0x0FU << CSR_ACSMCSMASK_LSB | 0x1U << CSR_ACSMCSMODE_LSB);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (C0 | TACSM | CSR_ACSMCTRL23_ADDR))), regdata);
}

/*
 * Set PllForceCal to 1 and PllDacValIn to some arbitrary value
 */
static void pllforcecal_plldacvalin_program(void)
{
  uint16_t dacval_in = 0x10U;
  uint16_t force_cal = 0x1U;
  uint16_t pllencal = 0x1U;
  uint16_t maxrange = 0x1fU;
  int32_t pstate;
  uint16_t pllctrl3_gpr;
  uint16_t pllctrl3_startup;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    uint32_t p_addr = (uint32_t)pstate << 20;

    /* Just to test */
    switch (pstate)
    {
      case 0:
        dacval_in = 0x10U;
        break;
      case 1:
        dacval_in = 0x11U;
        break;
      case 2:
        dacval_in = 0x12U;
        break;
      case 3:
        dacval_in = 0x13U;
        break;
      default:
        dacval_in = 0x14U;
        break;
    }

    pllctrl3_startup = (uint16_t)((dacval_in << CSR_PLLDACVALIN_LSB) |
                                  (maxrange << CSR_PLLMAXRANGE_LSB));
    pllctrl3_gpr = pllctrl3_startup | (uint16_t)((force_cal << CSR_PLLFORCECAL_LSB) |
                                                 (pllencal << CSR_PLLENCAL_LSB));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TMASTER | CSR_PLLCTRL3_ADDR))),
                  pllctrl3_startup);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (p_addr | TINITENG | CSR_SEQ0BGPR6_ADDR))),
                  pllctrl3_gpr);
  }
}

/*
 * This function programs registers that are normally set by training
 * firmware.
 *
 * This function is used in lieu of running 1D or 1D training steps. PhyInit
 * calls this function when skip_train = true. In that case, PhyInit does not
 * execute training firmware and this function is called instead to program
 * PHY registers according to DRAM timing parameters specified in userInputSim
 * data structure. See documentation of ddrphy_phyinit_struct.h file
 * details of timing parameters available in skip training.
 *
 * \warning ddrphy_phyinit_progcsrskiptrain() only supports zero board
 * delay model. If system board delays are set or randomized, full 1D or 1D
 * initialization flow must be executed.
 *
 * This function replaces these steps in the PHY Initialization sequence:
 *  - (E) Set the PHY input clocks to the desired frequency
 *  - (F) Write the Message Block parameters for the training firmware
 *  - (G) Execute the Training Firmware
 *  - (H) Read the Message Block results
 *
 * \returns \c void
 */
void ddrphy_phyinit_progcsrskiptrain(void)
{
  uint16_t txdqsdly[NB_PS] = { };

  VERBOSE("%s Start\n", __func__);

  set_timings();

  /*
   * Program ATxDlY
   * For DDR4, DDR3 and LPDDR4, leave AtxDly[6:0] at default (0x0)
   */

  dfimrl_program();

  txdqsdlytg_program(txdqsdly);

  txdqdlytg_program(txdqsdly);

  rxendly_program();

#if STM32MP_LPDDR4_TYPE
  seq0bgpr_program();

  hwtlpcsen_program();

  pptdqscntinvtrntg_program();

  pptctlstatic_program();
#endif /* STM32MP_LPDDR4_TYPE */

  hwtcamode_program();

  dllgainctl_dlllockparam_program();

  acsmctrl23_program();

  pllforcecal_plldacvalin_program();

  /*
   * ##############################################################
   *
   * Setting PhyInLP3 to 0 to cause PIE to execute LP2 sequence instead of INIT on first
   * dfi_init_start.
   * This prevents any DRAM commands before DRAM is initialized, which is the case for
   * skip_train.
   *
   * Moved to here from dddrphy_phyinit_I_loadPIEImage()
   * These should not be needed on S3-exit
   *
   * Note this executes for SkipTrain only, *not* DevInit+SkipTrain
   * DevInit+SkipTrain already initializes DRAM and thus don't need to avoid DRAM commands
   *
   * ##############################################################
   */

  /*
   * Special skipTraining configuration to Prevent DRAM Commands on the first dfi
   * status interface handshake. In order to see this behavior, the first dfi_freq
   * should be in the range of 0x0f < dfi_freq_sel[4:0] < 0x14.
   */
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TINITENG | CSR_PHYINLP3_ADDR))), 0x0U);

  VERBOSE("%s End\n", __func__);
}
